Revit 2024 API
Parameter.UserModifiable Property
 Indicates whether the interactive user can modify the value of this parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool UserModifiable { get; }
Visual Basic
Public ReadOnly Property UserModifiable As Boolean
	Get
Visual C++
public:
property bool UserModifiable {
	bool get ();
}
Remarks
 Note that for shared parameters IsReadOnly can return false for shared parameters whose UserModifiable property is also false, because the value of those parameters can be modified by the API. If a parameter is governed by a formula, IsReadOnly would return true, even if the flag for UserModifiable was set to true when the shared parameter was created.
See Also
Parameter Class
Autodesk.Revit.DB Namespace